In [27]:
import pandas as pd

In [28]:

data = {
    'Nome': ['Adriano', 'Rodrigo', 'Juliano', 'Mateus', 'Luiza', 'Rodrigo', 'Ayres', 'Ana'],
    'Sobrenome': ['Soares', 'Tadewald', 'Faccioni', 'Kienzle', 'Cherobini', 'Vanzelotti','Schimtts','Hoffam'],
    'Idade Atual': [31, 31, 25, 35, 22, 21, 28, 20],
}

df = pd.DataFrame(data)

In [29]:
df[['Sobrenome','Idade Atual']]

    Sobrenome  Idade Atual
0      Soares           31
1    Tadewald           31
2    Faccioni           25
3     Kienzle           35
4   Cherobini           22
5  Vanzelotti           21
6    Schimtts           28
7      Hoffam           20

In [30]:
df.iloc[1:,2]

1    31
2    25
3    35
4    22
5    21
6    28
7    20
Name: Idade Atual, dtype: int64

In [32]:
df.loc[df['Nome'] =='Luiza']

    Nome  Sobrenome  Idade Atual
4  Luiza  Cherobini           22

In [35]:
df.loc[(df['Nome'] =='Rodrigo') & (df['Idade Atual'] <28)]

      Nome   Sobrenome  Idade Atual
5  Rodrigo  Vanzelotti           21

In [38]:
df.loc[(df['Nome'] == 'Rodrigo') | (df['Nome'] =='Juliano')]

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
2  Juliano    Faccioni           25
5  Rodrigo  Vanzelotti           21

In [40]:
nomes = ['Rodrigo', 'Juliano']
df.loc[df['Nome'] .isin(nomes)]

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
2  Juliano    Faccioni           25
5  Rodrigo  Vanzelotti           21

In [42]:
df.loc[df['Nome'].str.contains('ano')]

      Nome Sobrenome  Idade Atual
0  Adriano    Soares           31
2  Juliano  Faccioni           25